In [5]:
import numpy as np
import pandas as pd

In [12]:
data = pd.read_excel('data/Example.xlsx')
data

    Name  Age  Height
0   John   32     180
1   Jane   23     120
2  Bella   43     140
3   Axel   54     200

Now find the Age of John

In [28]:
data.loc[data["Name"]=="John"]["Age"]

0    32
Name: Age, dtype: int64

Or you can do it by setting index

In [29]:
data2 = data.set_index("Name")
data2

       Age  Height
Name
John    32     180
Jane    23     120
Bella   43     140
Axel    54     200

In [30]:
data2.loc["John"]["Age"]

32

In [31]:
data

    Name  Age  Height
0   John   32     180
1   Jane   23     120
2  Bella   43     140
3   Axel   54     200

In [35]:
data.loc[2]["Height"]

140

In [36]:
data.loc[2][2]

140